Channel/1D/R5200/0/RS_DNS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "10000";
    object      RS_DNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor> 
1025
(
(4.55386e-06 -4.43289e-09 -3.96613e-10 1.37859e-10 6.71293e-13 1.96404e-06)
(3.45911e-05 -7.51268e-08 -3.08602e-09 4.34518e-09 1.13803e-11 1.42719e-05)
(9.02926e-05 -3.03533e-07 -8.22359e-09 2.42949e-08 4.59922e-11 3.57313e-05)
(0.000170555 -7.42831e-07 -1.57863e-08 6.88409e-08 1.12574e-10 6.51824e-05)
(0.000288743 -1.74505e-06 -2.73339e-08 2.00956e-07 2.64541e-10 0.000104528)
(0.000415859 -2.87702e-06 -3.98165e-08 3.53168e-07 4.36189e-10 0.000146234)
(0.000595655 -5.22988e-06 -5.81172e-08 7.32598e-07 7.92999e-10 0.00019821)
(0.000780316 -7.68763e-06 -7.69486e-08 1.1313e-06 1.16572e-09 0.000251208)
...
)
;

boundaryField
{
    INLET
    {
        type            cyclic;
    }
    OUTLET
    {
        type            cyclic;
    }
    CENTER
    {
        type            symmetryPlane;
    }
    WALL
    {
        type            fixedValue;
        value           uniform (6.66667e-11 0 0 6.66667e-11 0 6.66667e-11);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
