Channel/1D/R5200/0/divRS_DNS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "10000";
    object      divRS_DNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0];


internalField   nonuniform List<vector> 
1025
(
(-0.00103032 5.63196e-05 1.56072e-07)
(-0.00385856 0.000311548 5.84664e-07)
(-0.00857766 0.000828417 1.29998e-06)
(-0.0184285 0.0022579 2.79396e-06)
(-0.027177 0.00362057 4.12095e-06)
(-0.044138 0.00673242 6.69331e-06)
(-0.0606913 0.00981694 9.20386e-06)
(-0.0793472 0.0136944 1.20255e-05)
...
)
;

boundaryField
{
    INLET
    {
        type            cyclic;
    }
    OUTLET
    {
        type            cyclic;
    }
    CENTER
    {
        type            symmetryPlane;
    }
    WALL
    {
        type            extrapolatedCalculated;
        value           uniform (-0.00103032 5.63196e-05 1.56072e-07);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
