Channel/1D/R5200/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

momentumSource
{
    type            meanVelocityForce;
	activate		yes;

	meanVelocityForceCoeffs
	{
		selectionMode	all;

		fields			(U);
		Ubar            (1.0 0 0);
		// patch			INLET;
		relaxation      0.3;
	}
}

/*
momentumSource
{
    type            directionalPressureGradientExplicitSource;
	activate		true;

	directionalPressureGradientExplicitSourceCoeffs
	{
		selectionMode	all;
		fields			(U);
		flowDir			(1 0 0);
		faceZone        f0Zone;

		model			volumetricFlowRateTable;
		// pressureDrop	0.05;
	}
}
*/

// ************************************************************************* //
